# 주식 종목 코드 리스트
stock_codes = {
    "005930.KS": "삼성전자",
    "000660.KS": "SK하이닉스",
    "373220.KS": "LG에너지솔루션",  # 수정
    "207940.KS": "삼성바이오로직스",  # 수정
    "005380.KS": "현대차",
    "000270.KS": "기아",
    "068270.KS": "셀트리온",
    "051910.KS": "LG화학",
    "006400.KS": "삼성SDI",
    "035420.KS": "네이버",
    "035720.KS": "카카오",
    "005490.KS": "POSCO홀딩스",
    "105560.KS": "KB금융",
    "055550.KS": "신한지주",
    "028260.KS": "삼성물산",
    "012330.KS": "현대모비스",
    "017670.KS": "SK텔레콤",  # 수정
    "034730.KS": "SK",  # 수정
    "003550.KS": "LG",  # 수정
    "066570.KS": "LG전자",
    "090430.KS": "아모레퍼시픽",  # 수정
    "015760.KS": "한국전력",
    "086790.KS": "하나금융지주",  # 수정
    "000810.KS": "삼성화재",
    "018260.KS": "삼성에스디에스",  # 수정
    "032830.KS": "삼성생명",
    "010140.KS": "삼성중공업",
    "009150.KS": "삼성전기",
    "000720.KS": "현대건설",
    "086280.KS": "현대글로비스",  # 수정
    "010950.KS": "S-Oil",
    "000120.KS": "CJ대한통운",
    "003490.KS": "대한항공",  # 수정
    "194480.KQ": "데브시스터즈",
    "042000.KQ": "카페24",
    "263750.KQ": "펄어비스",
    "225570.KQ": "넥슨게임즈",
    "068760.KQ": "셀트리온제약",
    "034020.KS": "두산에너빌리티",
    "000150.KS": "두산",
    "011170.KS": "롯데케미칼",
    "005830.KS": "DB손해보험",
    "316140.KS": "우리금융지주",  # 수정
    "006360.KS": "GS건설",
    "241560.KS": "두산밥캣",
    "041510.KQ": "에스엠",
    "352820.KS": "하이브",
    "035900.KQ": "JYP Ent.",
    "251270.KS": "넷마블",
    "039490.KS": "키움증권",
    "018250.KS": "애경산업",
    "293490.KQ": "카카오게임즈",
    "003230.KS": "삼양식품",
    "097950.KS": "CJ제일제당",  # 수정
    "086520.KQ": "에코프로",
    "036570.KS": "엔씨소프트",
    "247540.KQ": "에코프로비엠",
    "000100.KS": "유한양행",
    "185750.KS": "종근당",
    "272450.KS": "진에어",
    "029780.KS": "삼성카드",
    "138930.KS": "BNK금융지주",
    "196170.KQ": "알테오젠",
    "036460.KS": "한국가스공사",  # 수정
}
